# Panda SQL

In [2]:
import pandas as pd
import sqlalchemy

In [3]:
!pip install pymysql

Collecting pymysql
  Downloading PyMySQL-0.9.3-py2.py3-none-any.whl (47 kB)
Installing collected packages: pymysql
Successfully installed pymysql-0.9.3

In [3]:
# engine de conexão do mysql 

engine = sqlalchemy.create_engine('mysql+pymysql://root:Salmos4;1@localhost:3306/sakila')

**Metodo read_sql_table**

In [4]:
#Puxando a tabela COUNTRY 
df = pd.read_sql_table('country', engine)

C:\Users\santa\anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1366, "Incorrect string value: '\\xE3o de ...' for column 'VARIABLE_VALUE' at row 1")
  result = self._query(query)

In [5]:
df.head()

   country_id         country         last_update
0           1     Afghanistan 2006-02-15 04:44:00
1           2         Algeria 2006-02-15 04:44:00
2           3  American Samoa 2006-02-15 04:44:00
3           4          Angola 2006-02-15 04:44:00
4           5        Anguilla 2006-02-15 04:44:00

In [3]:
#Puxando a um coluna de uma tabela

df = pd.read_sql_table('country', engine, columns=["country_id","country"])

C:\Users\santa\anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1366, "Incorrect string value: '\\xE3o de ...' for column 'VARIABLE_VALUE' at row 1")
  result = self._query(query)

In [4]:
df.head()

   country_id         country
0           1     Afghanistan
1           2         Algeria
2           3  American Samoa
3           4          Angola
4           5        Anguilla

**Metodo read_sql_query**

In [5]:
#Criando um Dataframe a partir de uma query no banco com sql

df = pd.read_sql_query("select * from country", engine)

In [6]:
df.head()

   country_id         country         last_update
0           1     Afghanistan 2006-02-15 04:44:00
1           2         Algeria 2006-02-15 04:44:00
2           3  American Samoa 2006-02-15 04:44:00
3           4          Angola 2006-02-15 04:44:00
4           5        Anguilla 2006-02-15 04:44:00

In [17]:
#Criando um Dataframe a partir de uma query no banco com sql usando e indexando por uma coluna especifica

df = pd.read_sql_query("select * from country", engine, index_col='country_id')

In [27]:
df.head()

                 title  release_year  rental_rate  category_id
0         AMADEUS HOLY          2006         0.99            1
1      AMERICAN CIRCUS          2006         4.99            1
2   ANTITRUST TOMATOES          2006         2.99            1
3        ARK RIDGEMONT          2006         0.99            1
4  BAREFOOT MANCHURIAN          2006         2.99            1

In [24]:
#Criando um Dataframe de uma query ligando varias tabelas
query = '''
SELECT title, release_year, rental_rate, category_id 
from film F INNER JOIN film_category FC
ON F.film_id = FC.film_id;
'''

In [25]:
df = pd.read_sql_query(query,engine)

In [35]:
df.head()

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,17,ALONE TRIP,A Fast-Paced Character Study of a Composer And...,2006,1,None,3,0.99,82,14.99,R,"Trailers,Behind the Scenes",2006-02-15 05:03:42

**Criando um Dataframe apartir de uma query utilizando parametos dinamicos**

In [38]:
namequery = 'SELECT * FROM film WHERE title = %s'

In [39]:
df = pd.read_sql_query(namequery, engine, params=["ALONE TRIP"])

In [40]:
df.head()

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,17,ALONE TRIP,A Fast-Paced Character Study of a Composer And...,2006,1,None,3,0.99,82,14.99,R,"Trailers,Behind the Scenes",2006-02-15 05:03:42

In [1]:
#paramentros para ser usandos 0.99 & 2.99
query = ''' 
    select title, release_year, rental_rate, category_id 
    from film F INNER JOIN film_category FC
    ON F.film_id = FC.film_id
    where rental_rate >= %(params01)s and rental_rate <= %(params02)s;
'''

In [11]:
df = pd.read_sql_query(query, engine, params={'params01':'0.99', 'params02':'2.99'})

In [12]:
df.head()

              title  release_year  rental_rate  category_id
0  ACADEMY DINOSAUR          2006         0.99            6
1  ADAPTATION HOLES          2006         2.99            6
2  AFFAIR PREJUDICE          2006         2.99           11
3       AFRICAN EGG          2006         2.99            8
4      AGENT TRUMAN          2006         2.99            9

Parametros do método read_sql

In [13]:
#Criando um Dataframe a partir de uma query 
df = pd.read_sql(query, engine, params={'params01':'0.99', 'params02':'2.99'})

In [15]:
df.head()

              title  release_year  rental_rate  category_id
0  ACADEMY DINOSAUR          2006         0.99            6
1  ADAPTATION HOLES          2006         2.99            6
2  AFFAIR PREJUDICE          2006         2.99           11
3       AFRICAN EGG          2006         2.99            8
4      AGENT TRUMAN          2006         2.99            9

In [16]:
#Criando um Dataframe a partir de uma tabela
df = pd.read_sql("film", engine)

In [17]:
df.head()

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,None,6,0.99,86,20.99,PG,"{Deleted Scenes, Behind the Scenes}",2006-02-15 05:03:42
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,None,3,4.99,48,12.99,G,"{Trailers, Deleted Scenes}",2006-02-15 05:03:42
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,1,None,7,2.99,50,18.99,NC-17,"{Trailers, Deleted Scenes}",2006-02-15 05:03:42
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,1,None,5,2.99,117,26.99,G,"{Behind the Scenes, Commentaries}",2006-02-15 05:03:42
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,None,6,2.99,130,22.99,G,{Deleted Scenes},2006-02-15 05:03:42